Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The tests are also https://github.com/quarkusio/quarkus/tree/main/integration-tests/devtools/src/test/java/io/quarkus/devtools/codestarts/quarkus[grouped, window="_blank"]. You don't need to test the build as there is a specific grouped https://github.com/quarkusio/quarkus/blob/main/integration-tests/devtools/src/test/java/io/quarkus/devtools/codestarts/quarkus/QuarkusCodestartBuildIT.java[test, window="_blank"] for it. e.g.:
ja_jp: また、テストは https://github.com/quarkusio/quarkus/tree/main/integration-tests/devtools/src/test/java/io/quarkus/devtools/codestarts/quarkus[グループ化, window="_blank"] されています。ビルドのテストは、それ専用のグループ化された https://github.com/quarkusio/quarkus/blob/main/integration-tests/devtools/src/test/java/io/quarkus/devtools/codestarts/quarkus/QuarkusCodestartBuildIT.java[テスト, window="_blank"] があるので、必要ありません。例えば

source: The third and final type of health check procedures is startup. Startup procedures are defined as an option for slow starting containers (should not be needed in Quarkus) to delay the invocations of liveness probe which will take over from startup once the startup responds UP for the first time. Startup health checks are defined with the `@Startup` qualifier.
ja_jp: ヘルスチェックプロシージャの最後の3つ目のタイプはスタートアップです。スタートアッププロシージャは、起動が遅いコンテナ（Quarkusでは必要ないはず）のオプションとして定義されており、起動が初めてUPに応答すると起動から引き継がれるliveness probeの呼び出しを遅らせることができます。スタートアップのヘルスチェックは、 `@Startup` で定義されます。

source: The third approach is to use `quarkus.hibernate-orm.database.generation=none`. This approach is best when you are working on a copy of the production data but want to fully control the schema evolution. Or if you use a database schema migration tool like xref:flyway.adoc[Flyway] or xref:liquibase.adoc[Liquibase].
ja_jp: 3つ目の選択肢は `quarkus.hibernate-orm.database.generation=none` を使用することです。この方法は、本番データのコピーで作業しており、スキーマの変更を完全にコントロールしたい場合に最適です。あるいは、 xref:flyway.adoc[Flyway] や xref:liquibase.adoc[Liquibase]のようなデータベーススキーマ移行ツールを使用している場合です。

source: The third approach is to use `quarkus.hibernate-orm.schema-management.strategy=none`. This approach is best when you are working on a copy of the production data but want to fully control the schema evolution. Or if you use a database schema migration tool like xref:flyway.adoc[Flyway] or xref:liquibase.adoc[Liquibase].
ja_jp: 3 つ目のアプローチは、 `quarkus.hibernate-orm.schema-management.strategy=none` を使用することです。このアプローチは、本番データのコピーを使用して作業しているが、スキーマの進化を完全に制御したい場合に最適です。あるいは、 xref:flyway.adoc[Flyway] や xref:liquibase.adoc[Liquibase] のようなデータベーススキーマ移行ツールを使用している場合です。

source: The third reactive transaction is used to delete all entities.
ja_jp: 3 つ目のリアクティブトランザクションは、すべてのエンティティーを削除するために使用されます。

source: The throttled strategy can be seen as an asynchronous variant of the default "auto-commit" behavior described above. When enabled, the connector tracks each received message and monitors their acknowledgment. When the connector finds out that all messages before a position are processed successfully, it commits that position. This commit happens periodically to avoid committing too often.
ja_jp: スロットル戦略は、上述のデフォルトの「オートコミット」動作の非同期的な変形として見ることができます。有効にすると、コネクタは受信した各メッセージを追跡し、その確認応答を監視します。コネクタは、あるポジションの前のすべてのメッセージが正常に処理されたことを確認すると、そのポジションをコミットします。このコミットは、頻繁にコミットしないように定期的に行われます。

source: The throughput vs startup tradeoff, revisited
ja_jp: スループットと起動時間のトレードオフ、再訪

source: The time interval to expire incomplete chunks if a consumer fails to receive all the chunks in the specified time period. The default value is 1 minute.
ja_jp: コンシューマが指定された時間内にすべてのチャンクを受信できなかった場合に、不完全なチャンクを失効させる時間間隔。デフォルト値は 1 分です。

source: The time required to pre-load resources from Keycloak during startup depends on the number of resources, which might impact your application's initial load time.
ja_jp: 起動時に Keycloak からリソースを事前ロードするのに必要な時間はリソースの数によって異なり、アプリケーションの初期ロード時間に影響する可能性があります。

source: The time spent in analysis and compilation phases depends on how big the application is. The bigger the application, the longer it takes to compile it. However, there are certain features that can have an exponential effect. For example, when registering types and methods for reflection access, the analysis can’t easily see what’s behind those types or methods, so it has to do more work to complete the analysis step.
ja_jp: 解析とコンパイルの段階でかかる時間は、アプリケーションの大きさによって異なります。アプリケーションが大きければ大きいほど、コンパイルにかかる時間は長くなります。ただし、指数関数的な効果をもたらす機能もあります。例えば、リフレクションアクセスのために型やメソッドを登録する場合、解析はその型やメソッドの背後にあるものを簡単に見ることができないため、解析ステップを完了するためにはより多くの仕事をしなければなりません。

source: The time zone ID is parsed using `java.time.ZoneId#of(String)`.
ja_jp: タイムゾーンIDは、 `java.time.ZoneId#of(String)` を使って解析されます。

source: The time zone database is quite large, and loading it, for example when calling `TimeZone.getDefault()`, can take a noticeable amount of time.
ja_jp: タイムゾーンデータベースはかなり大きく、たとえば `TimeZone.getDefault()` を呼び出す際などにそれをロードすると、目に見えるほどの時間がかかることがあります。

source: The time-to-live of the send AMQP messages. 0 to disable the TTL Type: _long_
ja_jp: 送信 AMQP メッセージの time-to-live を指定します。0はTTLを無効にします Type: _long_

source: The time-to-live of the sent AMQP messages. 0 to disable the TTL Type: _long_
ja_jp: 送信した AMQP メッセージの TTL (time-to-live)。TTL を無効にする場合は 0 タイプ: _long_

source: The token encryption secret must be 32 characters long. Note that you only have to set `quarkus.oidc.token-state-manager.encryption-secret` if you prefer not to use `quarkus.oidc.credentials.secret` for encrypting the tokens or if `quarkus.oidc.credentials.secret` length is less than 32 characters.
ja_jp: トークン暗号化の秘密は、32 文字でなければなりません。トークンの暗号化に `quarkus.oidc.credentials.secret` を使用しない場合、または `quarkus.oidc.credentials.secret` の長さが 32 文字未満の場合のみ `quarkus.oidc.token-state-manager.encryption-secret` を設定する必要があることに留意してください。

source: The token encryption secret must be at least 32 characters long. If this key is not configured then either `quarkus.oidc.credentials.secret` or `quarkus.oidc.credentials.jwt.secret` will be hashed to create an encryption key.
ja_jp: トークンの暗号化シークレットは少なくとも32文字以上でなければなりません。このキーが設定されていない場合、 `quarkus.oidc.credentials.secret` または `quarkus.oidc.credentials.jwt.secret` のいずれかがハッシュ化されて暗号化キーが作成されます。

source: The token encryption secret must be at least 32 characters long. If this key is not configured, then either `quarkus.oidc.credentials.secret` or `quarkus.oidc.credentials.jwt.secret` will be hashed to create an encryption key.
ja_jp: トークンの暗号化シークレットは 32 文字以上である必要があります。 このキーが設定されていない場合は、 `quarkus.oidc.credentials.secret` または `quarkus.oidc.credentials.jwt.secret` のいずれかがハッシュ化されて暗号化キーが作成されます。

source: The token key id (`kid`) header value
ja_jp: トークンキー ID (`kid`) ヘッダー値

source: The topic, partition, and offset in each triplet can have the following variations:
ja_jp: 各トリプレットのトピック、パーティション、オフセットには、以下のようなバリエーションがあります。

source: The total bytes of memory the producer can use to buffer records waiting to be sent to the server. Type: _long_
ja_jp: サーバーへの送信待ちのレコードをバッファリングするために、プロデューサーが使用できるメモリの総バイト数 Type: _long_

source: The tracing functionality is supported and *on* by default.
ja_jp: トレース機能はサポートされており、デフォルトで *on* になっています。

source: The traffic shaping allows you to configure various parameters, such as write and read limitations (in bytes per second), check interval (the delay between two computations of the bandwidth), and maximum time to wait:
ja_jp: トラフィックシェーピングでは、書き込みと読み取りの制限（1秒あたりのバイト数）、チェック間隔（帯域幅の2回の計算間の遅延）、最大待機時間など、さまざまなパラメータを設定できます：

source: The training run can be triggered either at build time (minimal training) or through your integration tests.
ja_jp: トレーニング実行は、ビルド時 (最小限のトレーニング) にトリガーすることも、統合テストを通じてトリガーすることもできます。

source: The transaction context is propagated to all calls nested in the `@Transactional` method as you would expect (in this example `childDAO.addToGiftList()` and `santaDAO.addToSantaTodoList()`). The transaction will commit unless a runtime exception crosses the method boundary. You can override whether an exception forces the rollback or not by using `@Transactional(dontRollbackOn=SomeException.class)` (or `rollbackOn`).
ja_jp: トランザクション・コンテキストは、予想通り `@Transactional` メソッドにネストされたすべての呼び出しに伝搬されます (この例では `childDAO.addToGiftList()` と `santaDAO.addToSantaTodoList()`)。ランタイム例外がメソッドの境界を越えない限り、トランザクションはコミットされます。例外が発生したときに強制的にロールバックするかどうかは、 `@Transactional(dontRollbackOn=SomeException.class)` (または `rollbackOn`) を使ってオーバーライドできます。

source: The transaction is aborted if the pre-transaction block throws an exception (or produces a failure when using the reactive API).
ja_jp: プレトランザクションブロックが例外をスローした場合 (またはリアクティブ API を使用している場合はエラーを生成した場合)、トランザクションは中断されます。

source: The transformations are straightforward:
ja_jp: 変換は簡単です。

source: The transformer is only applied to classes.
ja_jp: トランスフォーマーはクラスにのみ適用されます。

source: The translation key becomes `quarkus-agroal-database_view`. (for the title, spaces replaced with underscores, lower-case.)
ja_jp: 翻訳キーは `quarkus-agroal-database_view` になります。 (タイトルについては、スペースはアンダースコアに置換され、小文字になります。)

source: The translation to and from JSON is done automatically by the Quarkus REST (formerly RESTEasy Reactive) extension, which is included in this guide's pom.xml file. If you want to add it manually to your application, add the below snippet to your application's pom.xml file:
ja_jp: JSONへの変換とJSONからの変換は、Quarkus REST（旧RESTEasy Reactive）エクステンションによって自動的に行われます。 このエクステンションは、このガイドのpom.xmlファイルに含まれています。 アプリケーションに手動で追加する場合は、以下のスニペットをアプリケーションのpom.xmlファイルに追加します：

source: The translation to and from JSON is done automatically by the Quarkus RESTEasy Reactive extension, which is included in this guide's pom.xml file. If you want to add it manually to your application, add the below snippet to your application's ppm.xml file:
ja_jp: JSON との間の変換は、このガイドの pom.xml ファイルに含まれている Quarkus RESTEasy Reactive エクステンションによって自動的に行われます。アプリケーションに手動で追加する場合は、以下のスニペットをアプリケーションの ppm.xml ファイルに追加します。

source: The translation to and from JSON is done automatically by the Quarkus RestEasy extension, which is included in this guide's pom.xml file. If you want to add it manually to your application, add the below snippet to your application's ppm.xml file:
ja_jp: JSONへの変換とJSONからの変換は、このガイドのpom.xmlファイルに含まれているQuarkus RestEasyエクステンションによって自動的に行われます。アプリケーションに手動で追加する場合は、以下のスニペットをアプリケーションのppm.xmlファイルに追加します：

source: The trigger fires for the first time two hours after the application start.
ja_jp: アプリケーション開始から2時間後に初めてトリガーが発射されます。

source: The true power of the Quarkus foundation becomes evident when examining how Apache Polaris leverages specific Quarkus features in its implementation. The catalog service integrates over 15 specialized extensions to deliver a production-ready, cloud-native Iceberg catalog. Here are a few examples of integration.
ja_jp: Quarkus 基盤の真の力は、Apache Polaris がその実装で特定の Quarkus 機能をどのように活用しているかを調べると明らかになります。カタログサービスは、15 を超える専門エクステンションを統合して、本番対応のクラウドネイティブな Iceberg カタログを提供します。ここでは、統合のいくつかの例を示します。

source: The truststore from which the trusted certificates are loaded.
ja_jp: 信頼済み証明書がロードされるトラストストア。

source: The truststore must contain the certificate chain's root certificate.
ja_jp: トラストストアに証明書チェーンのルート証明書が含まれている必要があります。

source: The two APIs are equivalent feature-wise. Actually the `Mailer` implementation is built on top of the `ReactiveMailer` implementation.
ja_jp: この2つのAPIは機能的には同等です。実際、 `Mailer` の実装は、 `ReactiveMailer` の実装の上に構築されています。

source: The two channels are mapped to Kafka topics using the Quarkus configuration file `application.properties`. For that, add the following to the file `producer/src/main/resources/application.properties`:
ja_jp: 2つのチャンネルは、Quarkus設定ファイル `application.properties` を使用してKafkaトピックにマッピングされます。そのためには、ファイル `producer/src/main/resources/application.properties` に次のように追加します。

source: The two methods each return a _reactive stream_ whose items are sent to the streams named `temperature-values` and `weather-stations`, respectively.
ja_jp: この2つのメソッドは _reactive stream_ を返し、そのアイテムはそれぞれ `temperature-values` と `weather-stations` という名前のストリームに送られます。

source: The two new code listings should be focused on the methods that were omitted before: `goodbye` from `src/main/java/org/acme/MyAcmeApplication.java`, and `testGoodbyeEndpoint` from `src/main/java/org/acme/MyAcmeApplicationTest.java`.
ja_jp: 2 つの新しいコードリストは、以前は省略されていたメソッドに注目する必要があります。つまり、 `src/main/java/org/acme/MyAcmeApplication.java` の `goodbye` と `src/main/java/org/acme/MyAcmeApplicationTest.java` の `testGoodbyeEndpoint` です。

source: The type is `java.lang.String`, the key is `name` and the default value is `Quarkus`.
ja_jp: タイプは `java.lang.String` で、キーは `name`、デフォルト値は `Quarkus` です。

source: The type name must match the `<protobuf package>.<protobuf message>` exactly!
ja_jp: 型名は `<protobuf package>.<protobuf message>` と正確に一致している必要があります！

source: The type of a default value is not validated in <<standalone, Qute standalone>>.
ja_jp: <<standalone, スタンドアロン Qute>> では、デフォルト値のタイプは検証されません。

source: The type of a default value is not validated in <<standalone,Qute standalone>>.
ja_jp: <<standalone,Qute standalone>> では、デフォルト値のタイプは検証されません。

source: The type of a default value is not validated in xref:standalone[Qute standalone].
ja_jp: xref:standalone[Qute standalone] 、ではデフォルト値の型は検証されません。

source: The type of a default value must be assignable to the type of the parameter declaration, i.e. the following parameter declaration is incorrect and results in a build failure: `{@org.acme.Foo foo=1}`.
ja_jp: デフォルト値のタイプは，パラメーター宣言のタイプに割り当て可能でなければなりません。すなわち、パラメーター宣言 (`{@org.acme.Foo foo=1}`) は不正確なため、ビルドに失敗します。

source: The type of a default value must be assignable to the type of the parameter declaration. For example, see the incorrect parameter declaration that results in a build failure: `{@org.acme.Foo foo=1}`.
ja_jp: デフォルト値の型は、パラメーター宣言の型に割り当て可能でなければなりません。これは、ビルドの失敗につながる誤ったパラメーター宣言の例です: `{@org.acme.Foo foo=1}`。

source: The type of the DLX to assign to the queue. Relevant only if auto-bind-dlq is true Type: _string_
ja_jp: キューに割り当てる DLX のタイプ。auto-bind-dlq が true の場合にのみ関連します。 Type: _string_

source: The type of the field with the `@ConfigItem` annotation determines the conversion that is applied to it. Quarkus extensions may use the full range of configuration types made available by SmallRye Config, which includes:
ja_jp: `@ConfigItem` アノテーションが付いたフィールドのタイプによって、適用される変換が決まります。Quarkus エクステンションは、SmallRye Config によって利用可能になるすべての設定タイプを使用できます。これには以下が含まれます。

source: The types of all fields annotated with `@jakarta.inject.Inject` are considered the component types.
ja_jp: `@jakarta.inject.Inject` でアノテーションが付けられたすべてのフィールドの型は、コンポーネント型と見なされます。

source: The types of test methods parameters that are not annotated with `@InjectMock`, `@SkipInject`, or `@org.mockito.Mock` are also considered the component types.
ja_jp: `@InjectMock`、 `@SkipInject`、または `@org.mockito.Mock` でアノテーションが付けられていないテストメソッドパラメーターの型も、コンポーネント型と見なされます。

source: The types of values that can be injected include:
ja_jp: 注入可能な値の種類は以下の通りです:

source: The typesafe GraphQL client depends on REST client, thus we included the `rest-client-reactive` extension in the `extensions` list. You may also switch to the traditional non-reactive `rest-client` if the rest of your application depends on the non-reactive RESTEasy stack (you can't mix reactive and non-reactive RESTEasy). If you're only going to use the dynamic GraphQL client and don't use RESTEasy in your application, you may leave out the REST client dependency completely. This command generates a project, importing the `smallrye-graphql-client` extension.
ja_jp: typesafeのGraphQLクライアントはRESTクライアントに依存するため、 `extensions` リストに `rest-client-reactive` エクステンションを含めました。アプリケーションの残りの部分が非リアクティブ RESTEasy スタックに依存している場合は、従来の非リアクティブ `rest-client` に切り替えることもできます（リアクティブ型と非リアクティブ型の RESTEasy を混在させることはできません）。ダイナミックGraphQLクライアントのみを使用し、アプリケーションでRESTEasyを使用しない場合は、RESTクライアントの依存関係を完全に除外することができます。このコマンドはプロジェクトを生成し、 `smallrye-graphql-client` エクステンションをインポートします。

source: The typesafe client can be viewed as a rather high-level and more declarative approach designed for ease of use, whereas the dynamic client is lower-level, more imperative, somewhat more verbose to use, but allows finer grained control over operations and responses.
ja_jp: タイプセーフ・クライアントは、使いやすさを重視したハイレベルで宣言的なアプローチと見ることができます。一方、ダイナミック・クライアントは、低レベルで命令的なアプローチであり、使い勝手はやや冗長ですが、操作や応答をより細かく制御することができます。

source: The unique build infrastructure of Quarkus allows you to solve complex issues in a very simple way by developing custom extensions.
ja_jp: Quarkusのユニークなビルドインフラストラクチャでは、カスタムエクステンションを開発することで、非常にシンプルな方法で複雑な問題を解決することができます。

source: The update command primarily employs OpenRewrite recipes to automate updates for most project dependencies, source code, and documentation. Although these recipes update many migration items, they do not cover all the items detailed in the {quarkus-migration-guide}.
ja_jp: updateコマンドは主にOpenRewriteのレシピを使い、プロジェクトの依存関係、ソースコード、ドキュメントの更新を自動化します。 これらのレシピは多くのマイグレーション項目を更新しますが、 {quarkus-migration-guide} に詳しく書かれているすべての項目をカバーしているわけではありません。

source: The updated link:/guides/kafka-schema-registry-avro[Using Apache Kafka with schema registry and Avro guide] contains everything you need to know about these changes.
ja_jp: 更新された link:/guides/kafka-schema-registry-avro[schema registoryとarvoと共にApache kafkaを使用ガイド] には、これらの変更について知る必要があるすべての情報が記載されています。

source: The uploaded events are stored under the project's `/target` folder with the name `build-analytics-event.json`.
ja_jp: アップロードされたイベントは、プロジェクトの `/target` フォルダの下に `build-analytics-event.json` という名前で保存されます。

source: The use in native images requires a dependency on the entity view annotation processor that may be extracted into a separate `native` profile:
ja_jp: ネイティブイメージでの使用には、別の `native` プロファイルに抽出される可能性のあるエンティティービューアーノテーションプロセッサーへの依存関係が必要です:

source: The use of *the https://opentelemetry.io/docs/instrumentation/java/automatic/[OpenTelemetry Agent] is not needed nor recommended*. Quarkus Extensions and the libraries they provide, are directly instrumented. That agent doesn't work with native mode.
ja_jp: *the https://opentelemetry.io/docs/instrumentation/java/automatic/[OpenTelemetry エージェント] の使用は不要であり、推奨もされません*。Quarkus エクステンションとそれらが提供するライブラリーは、直接計装されます。そのエージェントはネイティブモードでは動作しません。

source: The use of `@MultipartForm` is actually unnecessary as RESTEasy Reactive can infer this information from the use of `@Consumes(MediaType.MULTIPART_FORM_DATA)`
ja_jp: RESTEasy Reactive は `@Consumes(MediaType.MULTIPART_FORM_DATA)` の使用からこの情報を推測できるので、 `@MultipartForm` の使用は実際には不要です。

source: The use of `@io.quarkus.test.vertx.RunOnVertxContext` or `@io.quarkus.test.TestReactiveTransaction` on the test methods
ja_jp: テストメソッドでの `@io.quarkus.test.vertx.RunOnVertxContext` または `@io.quarkus.test.TestReactiveTransaction` の使用

source: The use of `io.quarkus.test.vertx.UniAsserter` as a test method parameter.
ja_jp: テストメソッドのパラメータとして `io.quarkus.test.vertx.UniAsserter` の使用

source: The use of `org.springframework.data.jpa.repository.Lock`
ja_jp: `org.springframework.data.jpa.repository.Lock` の使用

source: The use of link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/MultipartForm.html[`@MultipartForm`] as method parameter makes RESTEasy Reactive handle the request as a multipart form request.
ja_jp: link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/MultipartForm.html[`@MultipartForm`] をメソッドパラメーターとして使用すると、RESTEasy Reactive はマルチパートフォームリクエストとして処理することができるようになります。

source: The use of multiple MongoDB clients enables multi-tenancy for MongoDB by allowing to connect to multiple MongoDB clusters. + If you want to connect to multiple databases inside the same cluster, multiple clients are **not** necessary as a single client is able to access all databases in the same cluster (as a JDBC connection is able to access to multiple schemas inside the same database).
ja_jp: 複数の MongoDB クライアントを使うことで、複数の MongoDB クラスターに接続できるようになり、MongoDB のマルチテナンシーが可能になります。+ 同じクラスター内の複数のデータベースに接続したい場合は、(JDBC接続が同じデータベース内の複数のスキーマにアクセスできるように) 1つのクライアントで同じクラスター内のすべてのデータベースにアクセスできるので、複数のクライアントは必要あり *ません* 。

source: The use of multiple MongoDB clients enables multi-tenancy for MongoDB by allowing to connect to multiple MongoDB clusters. + If you want to connect to multiple databases inside the same cluster, multiple clients are **not** necessary as a single client is able to access all databases in the same cluster (like a JDBC connection is able to access to multiple schemas inside the same database).
ja_jp: 複数の MongoDB クライアントを使うことで、複数の MongoDB クラスターに接続できるようになり、MongoDB のマルチテナンシーが可能になります。+ 同じクラスター内の複数のデータベースに接続したい場合は、(JDBC接続が同じデータベース内の複数のスキーマにアクセスできるように) 1つのクライアントで同じクラスター内のすべてのデータベースにアクセスできるので、複数のクライアントは必要あり *ません* 。

source: The use of the `quarkus-kubernetes-config` extensions is completely optional as there are other ways an application can be configured to use ConfigMaps or Secrets.
ja_jp: アプリケーションがConfigMapsやSecretsを使用するように設定する方法は他にもあるため、 `quarkus-kubernetes-config` エクステンションの使用は完全に任意です。

source: The user `adminUser` should be forbidden to access a resource protected with `@RolesAllowed("standardRole")` because it doesn't have this role.
ja_jp: ユーザー `adminUser` は、この役割を持っていないので、 `@RolesAllowed("standardRole")` で保護されたリソースへのアクセスを禁止する必要があります。

source: The user `admin` has the `user` and `admin` roles by default - it can be customized with a `keycloak.token.admin-roles` system property.
ja_jp: ユーザー `admin` にはデフォルトで `user` と `admin` の両方のロールが付与されており、これは `keycloak.token.admin-roles` システムプロパティーでカスタマイズできます。

source: The user `admin` should be forbidden to access a resource protected with `@RolesAllowed("user")` because it doesn't have this role.
ja_jp: ユーザー `admin` は、この役割を持っていないので、 `@RolesAllowed("user")` で保護されたリソースへのアクセスを禁止する必要があります。

source: The user clicks the link, and Quarkus OIDC redirects to the OIDC provider for re-authentication. Use `quarkus.oidc.authentication.session-expired-page` relative path property, if you would like to do it.
ja_jp: ユーザーがリンクをクリックすると、Quarkus OIDC は再認証のために OIDC プロバイダーにリダイレクトします。必要に応じて、 `quarkus.oidc.authentication.session-expired-page` 相対パスプロパティーを使用します。

source: The user input
ja_jp: ユーザー入力

source: The user to password mappings are specified in the `application.properties` file by properties keys of the form `quarkus.security.users.embedded.users.<user>=<password>`. The following <<password-example>> illustrates the syntax with 4 user-to-password mappings:
ja_jp: ユーザーとパスワードのマッピングは、 `application.properties` ファイル内で、 `quarkus.security.users.embedded.users.<user>=<password>` という形式のプロパティ・キーによって指定されます。 次の <<password-example>> は、4つのユーザーとパスワードのマッピングの構文を示しています：

source: The user to password mappings are specified in the `application.properties` file by properties keys of the form `quarkus.security.users.embedded.users.<user>=<password>`. The following xref:password-example[Example of passwords] illustrates the syntax with 4 user-to-password mappings:
ja_jp: ユーザーとパスワードのマッピングは、 `application.properties` ファイルで、 `quarkus.security.users.embedded.users.<user>=<password>` という形式のプロパティキーによって指定されます。次の xref:password-example[パスワードの例] は、4つのユーザーとパスワードのマッピングを持つ構文を示しています:

source: The user to password mappings are specified in the `application.properties` file by properties keys of the form `quarkus.security.users.embedded.users.<user>=<password>`. The following <<password-example>> illustrates the syntax with 4 user to password mappings:
ja_jp: ユーザーからパスワードへのマッピングは、 `application.properties` ファイル内で `quarkus.security.users.embedded.users.<user>=<password>` 形式のプロパティーキーで指定します。以下の link:#password-example[password-example] は]、4 つのユーザーからパスワードへのマッピングの構文を示しています:

source: The user to role mappings are specified in the `application.properties` file by properties keys of the form `quarkus.security.users.embedded.roles.<user>=role1[,role2[,role3[,...]]]`. The following <<roles-example>> illustrates the syntax with 4 user-to-role mappings:
ja_jp: ユーザーとロールのマッピングは、 `application.properties` ファイルで、 `quarkus.security.users.embedded.roles.<user>=role1[,role2[,role3[,…​]]]` という形式のプロパティキーによって指定されます。 次の <<roles-example>> は、4つのユーザーからロールへのマッピングを持つ構文を示しています：
